/* Задача 0.
Напишите программу, которая на вход принимает число и выдает его квадрат (умножение на само себя)  

Например:
4 -> 16
-3 -> 9
-7 -> 49 

Console.Write("Введите чиcло: ");
int number = int.Parse(Console.ReadLine()!);
int sqr = number * number;
Console.WriteLine("Квадрат числа " + number + " равен " + sqr); */

